keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMcds_reg.h
/** \\brief  82C, Event Definition Register */
#define MCDS_MCX_EVT11 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E882Cu)

/** Alias (User Manual Name) for MCDS_MCX_EVT11.
* To use register names with standard convension, please use MCDS_MCX_EVT11.
*/
#define	MCDS_MCXEVT11	(MCDS_MCX_EVT11)

/** \\brief  830, Event Definition Register */
#define MCDS_MCX_EVT12 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8830u)

/** Alias (User Manual Name) for MCDS_MCX_EVT12.
* To use register names with standard convension, please use MCDS_MCX_EVT12.
*/
#define	MCDS_MCXEVT12	(MCDS_MCX_EVT12)

/** \\brief  834, Event Definition Register */
#define MCDS_MCX_EVT13 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8834u)

/** Alias (User Manual Name) for MCDS_MCX_EVT13.
* To use register names with standard convension, please use MCDS_MCX_EVT13.
*/
#define	MCDS_MCXEVT13	(MCDS_MCX_EVT13)

/** \\brief  838, Event Definition Register */
#define MCDS_MCX_EVT14 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8838u)

/** Alias (User Manual Name) for MCDS_MCX_EVT14.
* To use register names with standard convension, please use MCDS_MCX_EVT14.
*/
#define	MCDS_MCXEVT14	(MCDS_MCX_EVT14)

/** \\brief  83C, Event Definition Register */
#define MCDS_MCX_EVT15 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E883Cu)

/** Alias (User Manual Name) for MCDS_MCX_EVT15.
* To use register names with standard convension, please use MCDS_MCX_EVT15.
*/
#define	MCDS_MCXEVT15	(MCDS_MCX_EVT15)

/** \\brief  808, Event Definition Register */
#define MCDS_MCX_EVT2 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8808u)

/** Alias (User Manual Name) for MCDS_MCX_EVT2.
* To use register names with standard convension, please use MCDS_MCX_EVT2.
*/
#define	MCDS_MCXEVT2	(MCDS_MCX_EVT2)

/** \\brief  80C, Event Definition Register */
#define MCDS_MCX_EVT3 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E880Cu)

/** Alias (User Manual Name) for MCDS_MCX_EVT3.
* To use register names with standard convension, please use MCDS_MCX_EVT3.
*/
#define	MCDS_MCXEVT3	(MCDS_MCX_EVT3)

/** \\brief  810, Event Definition Register */
#define MCDS_MCX_EVT4 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8810u)

/** Alias (User Manual Name) for MCDS_MCX_EVT4.
* To use register names with standard convension, please use MCDS_MCX_EVT4.
*/
#define	MCDS_MCXEVT4	(MCDS_MCX_EVT4)

/** \\brief  814, Event Definition Register */
#define MCDS_MCX_EVT5 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8814u)

/** Alias (User Manual Name) for MCDS_MCX_EVT5.
* To use register names with standard convension, please use MCDS_MCX_EVT5.
*/
#define	MCDS_MCXEVT5	(MCDS_MCX_EVT5)

/** \\brief  818, Event Definition Register */
#define MCDS_MCX_EVT6 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8818u)

/** Alias (User Manual Name) for MCDS_MCX_EVT6.
* To use register names with standard convension, please use MCDS_MCX_EVT6.
*/
#define	MCDS_MCXEVT6	(MCDS_MCX_EVT6)

/** \\brief  81C, Event Definition Register */
#define MCDS_MCX_EVT7 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E881Cu)

/** Alias (User Manual Name) for MCDS_MCX_EVT7.
* To use register names with standard convension, please use MCDS_MCX_EVT7.
*/
#define	MCDS_MCXEVT7	(MCDS_MCX_EVT7)

/** \\brief  820, Event Definition Register */
#define MCDS_MCX_EVT8 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8820u)

/** Alias (User Manual Name) for MCDS_MCX_EVT8.
* To use register names with standard convension, please use MCDS_MCX_EVT8.
*/
#define	MCDS_MCXEVT8	(MCDS_MCX_EVT8)

/** \\brief  824, Event Definition Register */
#define MCDS_MCX_EVT9 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8824u)

/** Alias (User Manual Name) for MCDS_MCX_EVT9.
* To use register names with standard convension, please use MCDS_MCX_EVT9.
*/
#define	MCDS_MCXEVT9	(MCDS_MCX_EVT9)

/** \\brief  14, MCDS Signal Source Control */
#define MCDS_MUX /*lint --e(923)*/ (*(volatile Ifx_MCDS_MUX*)0xF90E8014u)

/** \\brief  4, OCDS Control and Status */
#define MCDS_OCS /*lint --e(923)*/ (*(volatile Ifx_MCDS_OCS*)0xF90E8004u)

/** \\brief  2008, Current Instruction Pointer */
#define MCDS_TCX_CIP /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCX_CIP*)0xF90EA008u)

/** Alias (User Manual Name) for MCDS_TCX_CIP.
* To use register names with standard convension, please use MCDS_TCX_CIP.
*/
#define	MCDS_TCXCIP	(MCDS_TCX_CIP)

/** \\brief  2000, Debug Status Register */
#define MCDS_TCX_DCSTS /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCX_DCSTS*)0xF90EA000u)

/** Alias (User Manual Name) for MCDS_TCX_DCSTS.
* To use register names with standard convension, please use MCDS_TCX_DCSTS.
*/
#define	MCDS_TCXDCSTS	(MCDS_TCX_DCSTS)

/** \\brief  2400, Comparator Bound Register */
#define MCDS_TCX_EA0_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xF90EA400u)

/** Alias (User Manual Name) for MCDS_TCX_EA0_BND.
* To use register names with standard convension, please use MCDS_TCX_EA0_BND.
*/
#define	MCDS_TCXEABND0	(MCDS_TCX_EA0_BND)

/** \\brief  2404, Comparator Range Register */
#define MCDS_TCX_EA0_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xF90EA404u)

/** Alias (User Manual Name) for MCDS_TCX_EA0_RNG.
* To use register names with standard convension, please use MCDS_TCX_EA0_RNG.
*/
#define	MCDS_TCXEARNG0	(MCDS_TCX_EA0_RNG)

/** \\brief  2410, Comparator Bound Register */
#define MCDS_TCX_EA1_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xF90EA410u)

/** Alias (User Manual Name) for MCDS_TCX_EA1_BND.
* To use register names with standard convension, please use MCDS_TCX_EA1_BND.
*/
#define	MCDS_TCXEABND1	(MCDS_TCX_EA1_BND)

/** \\brief  2414, Comparator Range Register */
#define MCDS_TCX_EA1_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xF90EA414u)

/** Alias (User Manual Name) for MCDS_TCX_EA1_RNG.
* To use register names with standard convension, please use MCDS_TCX_EA1_RNG.
*/
#define	MCDS_TCXEARNG1	(MCDS_TCX_EA1_RNG)

/** \\brief  3000, Comparator Bound Register */
#define MCDS_TCX_IP0_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xF90EB000u)

/** Alias (User Manual Name) for MCDS_TCX_IP0_BND.
* To use register names with standard convension, please use MCDS_TCX_IP0_BND.
*/
#define	MCDS_TCXIPBND0	(MCDS_TCX_IP0_BND)

/** \\brief  3004, Comparator Range Register */
#define MCDS_TCX_IP0_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xF90EB004u)

/** Alias (User Manual Name) for MCDS_TCX_IP0_RNG.
* To use register names with standard convension, please use MCDS_TCX_IP0_RNG.
*/
#define	MCDS_TCXIPRNG0	(MCDS_TCX_IP0_RNG)

/** \\brief  3010, Comparator Bound Register */
#define MCDS_TCX_IP1_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xF90EB010u)

